import telebot

# --------------------------Токены--------------------------
BOT_TOKEN = "7556886894:AAE67gaiIKGI5CIlxOZ_tplzftphLm3W2n4"  # Токен бота
bot = telebot.TeleBot(BOT_TOKEN)
need_confirmations = 0
test_send_phone = 0
bot_name = 'https://t.me/end_soft'
# --------------------------Токены--------------------------


# --------------------------Ссылки--------------------------
FAQ = "https://telegra.ph/end_soft"  # Ссылка на faq
SUPPORT = "https://t.me/end_soft"  # Ссылка на саппорта
CHANNEL = "https://t.me/end_soft"  # Ссылка на канал
# Польз.соглашение
RULES = "https://telegra.ph/end_soft"
# --------------------------Ссылки--------------------------


# ---------------------------Файлы--------------------------
PATH_2_BD = "etc\data\data_base.db"
PATH_2_LOG = "etc\data\log.txt"
PATH_2_SH = "etc/data/sh/sost.bd"
# ---------------------------Файлы--------------------------


# -------------------------Coinbase-------------------------
API_KEY = ""  # Апи ключ от биржи
PRIVATE_KEY = ""
# -------------------------Coinbase-------------------------


# ---------------------------Юзеры--------------------------
ADMINS_ID = [8473087607]
# ---------------------------Юзеры--------------------------


# #------------------------Commission------------------------
REMOVAL = 0.0002  # Комиссия на вывод btc
# ------------------------Commission------------------------


# --------------------------Limits--------------------------
ON_REMOVAL = 0.0001  # мин. вывод btc
# --------------------------Limits--------------------------


# ------------------------Об обменах------------------------
min_byu_btc = 500  # мин. покупка (руб)
min_sell_btc = 500  # мин. продажа
max_in_btc = 0.0028

commission_on_byu = 8  # на покупку BTC %
commission_on_sell = -5  # на продажу %

REFERAL_INCOME = 10  # реф. %
