# -------------------------------При открытие бота------------------------------
soglas = """⚠️ Перед началом работы необходимо принять\nусловия <a href="{}">пользовательского соглашения</a> ➪"""
start = """
<b>👋 Добро пожаловать дорогой друг!</b>

🌎 <b>{}</b> - это быстрый и безопасный сервис покупки/продажи <b>BITCOIN</b>

⚡ Собственное безопасное хранилище ваших денег

⚡ Реферальная Система/Ваучеры и многое другое

"""
rules = """
ℹ️ <b>О сервисе</b>
➖➖➖➖➖➖➖➖➖➖
❒ Наша служба поддержки на связи 24/7 и с радостью ответит на любые ваши вопросы, связанные с работой бота! 
(Чтобы связаться с оператором нажмите на кнопку "Поддержка" под этим сообщением)

❒ Мы всегда рады любой обратной связи от наших клиентов!
"""

# ---------Когда активируешь уже активированный или неправильный ваучер---------
incorrect_voucher_code = """
Ваучер недействителен либо уже использован 😟
"""

# ------------------Когда активировали, созданой тобой ваучер-------------------
your_voucher_acvtivate = "Ваш ваучер на <code>{}</code> <b>BTC</b> активировали."

# ----------------------------При нажатие на профиль----------------------------
profile = """
<i>👤 Профиль</i>
➖➖➖➖➖➖➖➖➖➖
🌐 <b>ID:</b> {}
📆 <b>Дата рег.:</b> {}

👥 <b>Приглашено:</b> {}
💰 <b>Заработано:</b> {} <b>BTC</b>
➖➖➖➖➖➖➖➖➖➖➖➖
"""
info = """
<b>🔄 Обмен</b>
➖➖➖➖➖➖➖➖➖➖

Вы совершили <b>{} сделок</b> на сумму <b>{} <b>BTC</b></b>

"""
# ----------------------------При нажатие на кошелёк----------------------------
wallet = """
<b>🔐 Личный кабинет</b>
➖➖➖➖➖➖➖➖➖➖

🌐 <b>ID:</b> {}
⏰ <b>Дата регистрации:</b> {}

💰 <b>Баланс:</b> <code>{}</code> <b>BTC</b>
💰 <b>Баланс:</b> <code>{}.00</code> <b>RUB</b>
"""

# ----------------------При нажатие на пополнение кошелька----------------------
when_btc_refill = """
<b>📥 Пополнение баланса</b>
➖➖➖➖➖➖➖➖➖➖

⬇️ Для пополнения баланса отправьте <b>BTC</b> на кошелёк, указанный ниже.

<b>⏰</b> Зачисление происходит после <b>{} подтверждения</b>
"""

# -------------------Когда проверяешь кошелёк и деньги пришли-------------------
when_btc_came = """
🆕 Новое поступление средств в размере <code>{}</code> <b>BTC</b>
"""

# -----------------Если нет минимальной суммы для снятия средств----------------
min_removal = """
🚫 Недостаточно средств!

ℹ️ Мин. сумма на балансе для вывода: {}฿
(от {}฿ + комиссия {}฿)
"""
removal_address = """
<b>📤 Вывод средств</b>
➖➖➖➖➖➖➖➖➖➖

🔢 Укажите <b>BTC-адрес</b> получателя транзакции

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>3JgbFHscpmgJ3kmf
q9mHXRKbUdT3693XS4</code>
"""
# -----------------Если нет минимальной суммы для снятия средств----------------
sum_removal = """
<b>📤 Вывод средств</b>
➖➖➖➖➖➖➖➖➖➖
Введите сумму в <b>BTC</b>

💰 Ваш баланс: <code>{}</code> <b>BTC</b>
🧮 Комиссия: <code>{}</code> <b>BTC</b>

📉 <b>Min.  ≽</b> <code>{}</code> <b>BTC</b>
📈 <b>Max. ≼</b> <code>{}</code> <b>BTC</b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>0.07322  0.1</code>
"""

# -------------------------Перед подтверждением о выводе------------------------
removal = """
<b>📤 Вывод средств</b>
➖➖➖➖➖➖➖➖➖➖

🌐 Получатель: <code>{}</code>
💸 Сумма: <code>{}</code> <b>BTC</b>
🧮 Комиссия: <code>{}</code> <b>BTC</b>

💰 Останется: <code>{}</code> <b>BTC</b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Нажмите <b>"Отправить"</b> для
совершения операции
"""

# -------------------Уведомление админов о фин операции юзера--------------------
admin_notific_about_money = """
Юзер <code>{}</code> совершил <b>{}</b>
Сумма <b>{} <b>BTC</b></b>
"""

# ---------------------Когда юзер нажал перевести в кошельке--------------------
when_money_transfer = """
<b>💸 Перевод средств</b>
➖➖➖➖➖➖➖➖➖➖

ℹ️ Переводите <b>BTC</b> другимпользователям моментально и без комиссии: 
для этого укажите <b>@usеrname</b> (вместе с <b>@</b>) или <b>ID</b> получателя.

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>@CryptExHelp</code> 
<code>954249744</code>
"""

when_sum_transfer = """
<b>💸 Перевод средств</b>
➖➖➖➖➖➖➖➖➖➖

🔢 Введите сумму перевода <b>BTC</b>

Доступно: <code>{}</code> <b>BTC</b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>0.07322  0.1</code>
"""

# ----------------------Подверждение перевода другому юзеру---------------------
transfer = """
<b>💸 Перевод средств</b>
➖➖➖➖➖➖➖➖➖➖

🆔 получателя: <code>{}</code> 
💵 Сумма: <code>{}</code> <b>BTC</b>

💰 Останется: <code>{}</code> <b>BTC</b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Нажмите <b>"Перевести"</b> для совершения операции.
"""

# ---------Когда юзер переводит <b>BTC</b> по username, но такого usernamа нет---------
when_not_username = """
Пользователь с таким юзернеймом не обнаружен!
Повторите попытку ввода или отмените перевод
"""

# ------------------------При нажатие на кнопке ваучеры-------------------------
voucher = """
🎟 <b>Ваучеры</b>
➖➖➖➖➖➖➖➖➖➖

🎁 Здесь можно активировать полученный ваучер, а так же создать собственный.
"""

# ------------------------При нажатие на создать ваучер-------------------------
create_voucher = """
🎟 <b>Новый ваучер</b>
➖➖➖➖➖➖➖➖➖➖

🔢 Укажите сумму ваучера в <b><b>BTC</b></b>
(Доступно: <code>{}</code> <b>BTC</b>)
"""

# ------------Когда ваучер создался и при просмотре своих созданных-------------
when_create_voucher = """
🎟 <b>Новый ваучер</b>
➖➖➖➖➖➖➖➖➖➖
☑️ Ваучер успешно создан!

🔣 <b>Код:</b> <code>{}</code>
💵 <b>Сумма:</b> {} <b>BTC</b>
🌐 <b>Ссылка:</b> {}

Для активации ваучера отправьте ссылку/код ваучера получателю.

➖➖➖➖➖➖➖➖➖➖
<i>(Чтобы вернуть средства на баланс, перейдите по созданной ссылке сами
или активируйте предоставленный код в меню "<b>🎟 Ваучеры</b>")</i>
"""
my_vouchers = """
🎁 <b>Ваучер на сумму</b> <b>{}</b> <b>BTC</b>
➖➖➖➖➖➖➖➖➖➖➖➖
🔣 <b>Код:</b> <code>{}</code>
🌐 <b>Ссылка:</b> {}
➖➖➖➖➖➖➖➖➖➖➖➖
"""

# ------------Когда ваучер создался и при просмотре своих созданных-------------
one_step_byu_btc = """
<b>📈 Покупка ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

Введите сумму <b>к оплате</b> <b>RUB</b>
⇖ от <code>{}</code> до <code>{}</code>
или сумму <b>к получению</b> <b>BTC</b>
⇘ от <code>{}</code> до <code>{}</code> 

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>0.07322 3145</code>
"""
re_step_byu_btc = """ 
<b>🚫 ОШИБКА ВВОДА</b>
➖➖➖➖➖➖➖➖➖➖➖➖
⚠ Введите числовое значение 
<b>от</b> <code>{}</code> <b>BTC</b>
<b>до</b> <code>{}</code> <b>BTC</b>
(🇷🇺 <b>от</b> <code>{}</code><b> до </b><code>{}</code> <b>RUB</b>)
"""

# ------------------------Пользователь ввёл нужную сумму------------------------
two_step_byu_btc = """
<b>📈 Покупка ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

📊 Курс: {}₽ ≈ 1฿
<b>⇖ К оплате:</b> <code>{}.00</code> <b>RUB</b>
<b>⇘ К получению:</b> <code>{}</code> <b>BTC</b> 

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> <i>Чтобы продолжить нажмите 
<b>"➡️"</b>. Для изменения суммы 
отправьте новое значение.</i>
"""

three_step_byu_btc = """
<b>📈 Покупка ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
🔣 Введите адрес <b><b>BTC</b>-кошелька</b> для перевода.
⚠️ При указании вашего внутреннего кошелька 
(из личного кабинета бота) средства по сделке 
поступят мгновенно после оплаты.
➖➖➖➖➖➖➖➖➖➖
"""
four_step_byu_btc = """
<b>📈 Покупка ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

<b>⇖ К оплате:</b> <code>{}.00</code> <b><b>RUB</b></b>
• QIWI-кошелек: <code>{}</code>
• Коммент. к переводу: <code>{}</code>
<b>⇘ К получению:</b> <code>{}</code> <b>BTC</b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> <b>ОБЯЗАТЕЛЬНО</b> указывайте 
комментарий к платежу❗
"""

when_user_pay = """
<b>🤝 Благодарим за сделку!</b> 
➖➖➖➖➖➖➖➖➖➖

✅ <code>{}</code>฿ успешно зачислены 
на ваш счет!

➖➖➖➖➖➖➖➖➖➖
"""

one_step_sell_btc = """ 
<b>📉 Продажа ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

Введите сумму <b>к оплате</b> <b>BTC</b>
⇖ от <code>{}</code> до <code>{}</code>
или сумму <b>к получению</b> <b>RUB</b>
⇘ от <code>{}</code> до <code>{}</code>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> Пример: <code>0.07322 3145</code>
"""
re_step_sell_btc = """
<i>🚫 ОШИБКА ВВОДА</i>
➖➖➖➖➖➖➖➖➖➖ 
⚠ Введите числовое значение 
<b>от</b> <code>{}</code> <b><b>BTC</b></b>
<b>до</b> <code>{}</code> <b><b>BTC</b></b>
(🇷🇺 <b>от</b> <code>{}</code><b> до </b><code>{}</code> <b><b><b>RUB</b></b></b>)
"""
two_step_sell_btc = """
<b>📉 Продажа ฿ITCOIN</b>  
➖➖➖➖➖➖➖➖➖➖

📊 Курс: 1฿ ≈ {}₽
<b>⇖ К оплате:</b> <code>{}</code> <b>BTC</b>
<b>⇘ К получению:</b> <code>{}.00</code> <b><b>RUB</b></b>

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> <i>Чтобы продолжить нажмите 
<b>"➡️"</b>. Для изменения суммы 
отправьте новое значение.</i>
"""

three_step_sell_btc = """
<b>📉 Продажа ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

🔢 Введите в любом формате номер <b>QIWI-кошелька</b> для получения средств по сделке

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> <i>Примеры:</i> <code>79XXXXXXXXX
89XXXXXXXXX +79XXXXXXXXX</code>
"""

four_step_sell_btc = """
<b>📉 Продажа ฿ITCOIN</b>
➖➖➖➖➖➖➖➖➖➖

<b>⇖ К оплате:</b> <code>{}</code> <b>BTC</b>
<b>⇘ К получению:</b> <code>{}.00</code> <b><b>RUB</b></b>
 • на QIWI-кошелёк: <code>{}</code> 

➖➖➖➖➖➖➖➖➖➖
<b>☞</b> <i>Нажмите <b>"Оплатить"</b> для 
проведения обмена.</i>
"""

five_step_sell_btc = """
<i>🤝 Благодарим за сделку!</i> 
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
☑️ <code>{}.00</code>₽ успешно отправлены на QIWI-кошелёк <code>{}</code>
"""

ref_message = """
<b>🤝 Реферальная программа</b>
➖➖➖➖➖➖➖➖➖➖

🎁 Мы предлагаем зарабатывать <b>{}% от дохода обменника с каждой сделки приглашенных вами пользователей по нашей партнерской программе!</b>

🌐 <b>Ваша реферальная ссылка:</b>
{}

➖➖➖➖➖➖➖➖➖➖
👥 <b>Приглашено:</b> {} польз.
💲 <b>Заработано:</b> {} <b>BTC</b>

"""

if_nevalid_address = """
Указан невалидный адрес.
Повторите попытку ввода
"""
